Some sources of a volume divider are non-slab like.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DivideVolumesProfilesNonSlabSources { get; }
  Visual Basic
Public Shared ReadOnly Property DivideVolumesProfilesNonSlabSources As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DivideVolumesProfilesNonSlabSources {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DPartFailures Class
  Autodesk.Revit.DB Namespace